rails/byte_size_news/app/controllers/news/search_controller.rb

    def search_feed
      @issues = Issue.search(params[:query])
---
SELECT "issues".* FROM "issues" WHERE (lower(content) LIKE '%SEMO %' OR lower(title) LIKE '%SEMO %')